{
  "Users": [
    {
      "id": 1,
      "name": "John",
      "lastName": "Doe",
      "email": "john@example.com",
      "password": "password",
      "userType": 1,
      "createdAt": "2023-08-17T15:30:00Z",
      "updatedAt": ""
    },
    {
      "id": 2,
      "name": "Jane",
      "lastName": "Smith",
      "email": "jane@example.com",
      "password": "password",
      "userType": 2,
      "createdAt": "2023-08-17T15:31:00Z",
      "updatedAt": ""
    },
    {
      "id": 3,
      "name": "Wayne",
      "lastName": "Gretzky",
      "email": "greatone@mail.com",
      "userType": 1,
      "password": "password",
      "createdAt": "2023-08-30",
      "updatedAt": ""
    },
    {
      "id": 4,
      "name": "Pepe",
      "lastName": "Grillo",
      "email": "pepe2@example.com",
      "password": "password",
      "userType": 2,
      "createdAt": "2023-08-29T15:31:00Z",
      "updatedAt": ""
    },
    {
      "id": 5,
      "name": "Frank",
      "lastName": "Castle",
      "email": "punisher@mail.com",
      "userType": 2,
      "password": "password",
      "createdAt": "2023-08-30",
      "updatedAt": "2023-09-02T12:36:55.955Z"
    },
    {
      "id": 6,
      "name": "Jessee",
      "lastName": "Custer",
      "email": "preacher@mail.com",
      "userType": 2,
      "password": "password",
      "updatedAt": "2023-09-11T21:50:38.756Z"
    },
    {
      "id": 7,
      "name": "Wade P",
      "lastName": "Wilson",
      "email": "mrPool@mail.com",
      "userType": 2,
      "password": "pass1234",
      "updatedAt": "2023-09-07T18:16:14.148Z"
    },
    {
      "id": 8,
      "name": "Pepe",
      "lastName": "Sanchez",
      "email": "mail@mail.com",
      "userType": 2,
      "password": "password",
      "createdAt": "2023-09-02T12:34:50.311Z",
      "updatedAt": "2023-09-02T12:34:50.311Z"
    },
    {
      "id": 9,
      "name": "Priss",
      "lastName": "Replicant",
      "email": "rep@mail.com",
      "userType": 2,
      "password": "password",
      "createdAt": "2023-09-07T18:32:22.868Z",
      "updatedAt": "2023-09-08T21:33:58.258Z"
    },
    {
      "id": 10,
      "name": "Franco",
      "lastName": "Castillo",
      "email": "castigador@mail.com",
      "userType": 2,
      "password": "password",
      "createdAt": "2023-09-07T20:20:52.361Z",
      "updatedAt": "2023-09-07T20:20:52.361Z"
    },
    {
      "id": 11,
      "name": "Sarah",
      "lastName": "Pezzini",
      "email": "witchblade@mail.com",
      "userType": 2,
      "password": "password",
      "updatedAt": "2023-09-08T13:40:23.559Z"
    },
    {
      "id": 12,
      "name": "Izzy",
      "lastName": "Stradlin",
      "email": "gnr@mail.com",
      "userType": 2,
      "password": "password",
      "createdAt": "2023-09-08T13:42:14.337Z",
      "updatedAt": "2023-09-08T13:42:14.337Z"
    }
  ],
  "Recipe": [
    {
      "id": 1,
      "title": "Lomo al pepe",
      "description": [
        "Pon una cazuela con agua a fuego medio y, cuando esté hirviendo, añade los macarrones y cocínalos hasta que estén un poco al dente, ya que luego se calentarán con la carne. Cuando estén cocidos escúrrelos y resérvalos.",
        "Corta la carne en rodajas de 1 cm de grosor y salpimienta al gusto. Puedes hacer esta receta de lomo al pepe con lomo o con solomillo si lo prefieres.",
        "Pon una sartén amplia al fuego con las cuatro cucharadas de aceite de oliva. Cuando esté caliente, añade los trozos de carne, dóralos a fuego fuerte, sácalos y resérvalos.",
        "Pica la cebolla en trozos pequeños. Añade un poco más de aceite en la misma sartén donde has dorado la carne y, cuando esté caliente, sofríe la cebolla. Deja que se vaya cocinando hasta que se empiece a dorarse.",
        "Cuando la cebolla tenga, incorpora la nata, remueve y deja que la salsa coja los sabores de la sartén.",
        "Añade las dos cucharaditas de bovril. El bovril es un concentrado de carne que da muy buen sabor a esta receta de lomo al pepe y a otras que lleven carne. Podrás encontrarlo en supermercados.",
        "Agrega un poquito de sal y pimienta. De forma opcional, se puede añadir un chorrito de brandy. Mezcla hasta que estén todos los ingredientes bien integrados. Prueba de sal y rectifica si es necesario.",
        "Incorpora los trozos de carne y deja que se cocine todo durante 15 minutos o hasta que la carne esté tierna. Dependerá del tipo de carne que hayas usado y del grosor. En este paso verás que reducirá un poco la salsa, de manera que si ves que se queda muy seca se puede añadir un poco más de nata o si queda muy espesa un poco de leche.",
        "En el último minuto agrega los macarrones a la cazuela con la carne.",
        "Deja cocinar todo junto un par de minutos para que la pasta coja todo el sabor de la salsa. Prueba nuevamente de sal.",
        "Y ya estará listo este estupendo plato. Puedes servir la receta de lomo al pepe con un poco de pan para mojar en la salsa. Verás que se trata de un plato muy sencillo y muy sabroso al mismo tiempo, perfecto para cualquier ocasión."
      ],
      "ingredients": [
        "500 gramos de lomo de cerdo o solomillo.",
        "1 cebolla.",
        " 400 mililitros de nata para cocinar (crema de leche)",
        "2 cucharadas de postre de bovril.",
        "1 pizca de sal.",
        "1 pizca de pimienta (molida o en grano).",
        "4 cucharadas soperas de aceite de oliva.",
        "300 gramos de macarrones."
      ],
      "img": "https://cdn0.recetasgratis.net/es/posts/3/6/3/lomo_al_pepe_74363_600.webp",
      "userId": 1,
      "createdAt": "25/08/2023",
      "updatedAt": ""
    },
    {
      "id": 2,
      "title": "Super Pancho",
      "description": [
        "Poner a calentar Agua y poner las salchichas",
        "Cortar el pan de viena al medio",
        "Colocar las salchichas en el pan colocar adornando mayonesa y jamón"
      ],
      "ingredients": [
        "1 paquete salchichas",
        "pan de viena",
        "Mayonesa",
        "50 gramos jamón"
      ],
      "img": "https://img-global.cpcdn.com/recipes/7e8c364d35a14b04/1360x964cq70/panchos-super-foto-principal.webp",
      "userId": 1,
      "createdAt": "25/08/2023",
      "updatedAt": "2023-09-11T14:03:47.035Z"
    },
    {
      "id": 3,
      "title": "Sandwich de queso fundido",
      "description": [
        "Unta mantequilla en las partes exteriores de tus trozos de pan (las partes que van a tocar la sartén).",
        "Dentro del sandwich pon entre 1-4 trozos o lonchas de queso (dependiendo de tus gustos). Recomiendo una mezcla de quesos diferentes para que quede aún más cremoso! También añade aquí tus otros ingredientes (como tomate, pimientos asados, bacon frito, etc.)",
        "En una sartén precalentada a una temperatura media-baja pon el sandwich por un lado y cúbrelo con otra plato-bol que pese. Cocínalo lentamente (asegurando que no se queme) y cuando esté bien dorado dale la vuelta. Estará hecho cuando los dos lados queden bien dorados y el queso esté derretido y sobresaliendo un poco."
      ],
      "ingredients": [
        "Pan lactal",
        "Manteca",
        "Queso"
      ],
      "img": "https://recetasamericanas.com/wp-content/uploads/2011/12/3407778423_f056f6e9ee_o.jpg",
      "userId": 1,
      "createdAt": "2023-09-13T21:10:28.926Z",
      "updatedAt": "2023-09-13T21:10:28.926Z"
    },
    {
      "id": 4,
      "title": "Mini pizzas de jamón, rúcula y mozzarella",
      "description": [
        "Precalentar el horno a 180 ºC. Extender la masa de pizza en una superficie enharinada y cortar pequeñas porciones con un molde redondo.",
        "Lavar y escurrir las hojas de rúcula. Cortar en trozos el jamón y picar el orégano finamente. Preparar la mozzarella.",
        "Disponer una cucharadita de salsa de tomate sobre cada porción de masa. Cubrir con una hoja de rúcula, el jamón y la mozzarella rallada. Espolvorear con orégano seco y hornear durante cinco minutos. Servir."
      ],
      "ingredients": [
        "250g masa de pizza",
        "50g rúcula",
        "100g jamón de parna",
        "orégano",
        "50g queso mozzarella"
      ],
      "img": "https://hips.hearstapps.com/hmg-prod/images/recetas-diezminutos-1655541818.jpg?crop=1xw:1xh;center,top&resize=980:*",
      "userId": 1,
      "createdAt": "2023-09-13T22:07:55.022Z",
      "updatedAt": "2023-09-13T22:07:55.022Z"
    },
    {
      "id": 5,
      "title": "espaguetis con tomate",
      "description": [
        "Cocina los espaguetis en una olla grande con agua salada hirviendo. Sigue las instrucciones del paquete para saber el tiempo de cocción.",
        "Mientras los espaguetis se están cocinando, calienta el aceite de oliva en una sartén grande.",
        "Agrega el ajo picado y cocina a fuego medio hasta que esté dorado.",
        "Agrega el tomate triturado a la sartén y cocina a fuego medio-bajo durante unos 10-15 minutos, hasta que quede una salsa espesa.",
        "Si lo deseas puedes añadir albahaca fresca picada, que le da un sabor especial y delicioso. También puedes añadir otras especias como orégano o tomillo. Ve probando hasta que tengan el punto de sabor que tú deseas.",
        "Una vez que los espaguetis estén cocidos, escúrrelos y añádelos a la sartén con la salsa de tomate.",
        "Mezcla bien para que los espaguetis queden bien cubiertos con la salsa.",
        "Sirve los espaguetis en platos y decora con hojas de albahaca fresca si lo deseas."
      ],
      "ingredients": [
        " 500 g de espaguetis",
        "1 lata de tomate triturado",
        "2 dientes de ajo",
        "",
        "Aceite de oliva",
        "Sal y pimienta al gusto",
        "Hojas de albahaca fresca (opcional)"
      ],
      "img": "https://www.pequerecetas.com/wp-content/uploads/2023/03/espaguetis-con-tomate.jpg",
      "userId": 1,
      "createdAt": "2023-09-13T22:22:36.057Z",
      "updatedAt": "2023-09-13T22:22:36.057Z"
    },
    {
      "id": 6,
      "title": "Pastel de papa",
      "description": [
        "Colocar los huevos en una olla pequeña y cocinarlos a fuego medio alto. Cocinarlos durante 5 minutos contados desde el momento en que empieza a hervir el agua. Retirar del fuego y reservar.",
        " En una sartén se fríe la cebolla, la carne, el orégano, la sal y el merkén. Retirar del fuego cuando la carne esté dorada y la cebolla transparente, se incorporan las pasas y se reserva.",
        "  Enseguida se prepara el puré. Se pelan las papas, se ponen en una olla y se cubren con agua, se agrega 1 cucharada de sal y se cocinan durante 20 a 30 minutos. Una vez que estén blandas se escurre el agua y se muelen agregando mantequilla, sal y la leche hasta obtener un puré espeso y se reserva.",
        "Se ponen los platos en la bandeja del horno y se dejan gratinar. Para ello, espolvorear queso rallado y dejarlos unos minutos a 180 grados. También se les puede agregar azúcar granulada.",
        ""
      ],
      "ingredients": [
        "½ kg. de papas",
        " ½ kg. de carne molida",
        " 1 taza de leche",
        " 50 gramos de mantequilla",
        " 1 cebolla",
        " 2 huevos",
        " Aceitunas y pasas",
        " Sal a gusto",
        ""
      ],
      "img": "https://www.lanacion.com.ar/resizer/v2/64RCEDBW6VBB5PRK7PTUZBS3LU.jpg?auth=7a035444ff48c6eb57320c659ef658f7247086eb747f332b090242e5b8884fbd&width=880&height=586&quality=70&smart=true",
      "userId": 1,
      "createdAt": "2023-09-13T23:59:04.451Z",
      "updatedAt": "2023-09-13T23:59:04.451Z"
    }
  ],
  "Coments": [
    {
      "id": 1,
      "coment": "Comentario",
      "recipe_id": 1,
      "user_ id": 2,
      "createdAt": "2023-08-17T15:33:00Z",
      "updatedAt": ""
    },
    {
      "id": 2,
      "coment": "Comentario 2",
      "recipe_id": 1,
      "user_ id": 6,
      "createdAt": "2023-08-17T15:33:00Z",
      "updatedAt": ""
    },
    {
      "id": 3,
      "coment": "Comentario 3",
      "recipe_id": 1,
      "user_id": 6,
      "createdAt": "2023-08-25T15:33:00Z",
      "updatedAt": "2023-09-12T13:19:13.010Z"
    }
  ],
  "Article": [
    {
      "id": 1,
      "title": "El Correcto Uso de Utensilios de Cocina: Consejos Esenciales",
      "article": [
        "La cocina es un arte que requiere de habilidad, paciencia y una comprensión profunda de los utensilios adecuados. El uso correcto de los utensilios de cocina es esencial para preparar comidas deliciosas y seguras. En este artículo, exploraremos los principios básicos del uso adecuado de utensilios de cocina, desde cuchillos afilados hasta sartenes antiadherentes. ¡Vamos a sumergirnos en el mundo de la cocina!",
        "Cuchillos",
        "Los cuchillos son herramientas fundamentales en la cocina. Un cuchillo afilado es más seguro que uno desafilado, ya que requiere menos esfuerzo al cortar. Aquí hay algunos consejos sobre su uso adecuado:",
        "Mantén los cuchillos afilados: Afila tus cuchillos regularmente con una piedra de afilar o una chaira. Un cuchillo romo es más propenso a resbalar y causar lesiones.",
        "Usa una tabla de cortar adecuada: Evita dañar el filo del cuchillo cortando sobre superficies duras como vidrio o mármol. Opta por tablas de madera o plástico.",
        "Corta con movimientos suaves: Utiliza movimientos controlados y uniformes al cortar para evitar cortarte. Mantén tus dedos alejados de la trayectoria del cuchillo y utiliza la técnica del 'corte de garra' para sujetar los ingredientes de manera segura.",
        "Sartenes",
        "Las sartenes son esenciales para cocinar una amplia variedad de alimentos. Asegúrate de utilizarlas adecuadamente:",
        "Preparación adecuada: Antes de cocinar, precalienta la sartén a la temperatura correcta para evitar que los alimentos se peguen.",
        "Mantén la sartén limpia: Lava la sartén con agua tibia y detergente después de cada uso. Evita el uso de estropajos abrasivos que puedan dañar la superficie antiadherente.",
        "Utiliza utensilios de cocina adecuados: Evita el uso de utensilios de metal que puedan rayar la superficie de la sartén antiadherente. Opta por utensilios de madera, silicona o plástico.",
        "Cacerolas y Ollas",
        "Las cacerolas y ollas son imprescindibles para cocinar guisos, sopas y otros platos. Aquí tienes algunos consejos:",
        "Distribución uniforme del calor: Asegúrate de que el tamaño de la cacerola sea adecuado para la fuente de calor. Una cacerola más grande que la hornilla puede provocar una cocción desigual.",
        "Cuidado con la temperatura: Evita calentar la cacerola en exceso. Cocinar a fuego medio o bajo puede ser suficiente en muchas ocasiones y previene que los alimentos se quemen o peguen.",
        "Revuelve regularmente: Al cocinar alimentos que requieran tiempo en la cacerola, revuelve regularmente para evitar que se peguen o se quemen en el fondo.",
        "Utensilios de Medición",
        "La precisión en la cocina es crucial, especialmente al hornear. Utiliza utensilios de medición correctamente:",
        "Niveles de llenado: Cuando mides ingredientes secos, como harina o azúcar, llena la taza de medir y nivélala con una espátula o un cuchillo para obtener una medición precisa.",
        "Usa utensilios secos: Asegúrate de que los utensilios de medición estén secos al medir ingredientes secos y líquidos al medir ingredientes líquidos para evitar errores en las proporciones.",
        "Mide con precisión: Sigue las recetas al pie de la letra y utiliza tazas y cucharas de medición estándar para obtener resultados consistentes."
      ],
      "img": "https://vallesdelesla.com/wp-content/uploads/2023/02/utensilios-cocina-chef.jpeg",
      "user_id": 1,
      "createdAt": "2023-08-17T15:34:00Z",
      "updatedAt": "2023-09-10T16:32:00.336Z"
    },
    {
      "id": 2,
      "title": "¡Aprovechando al Máximo los Ratones en la Cocina!",
      "article": [
        "¿Estás cansado de los mismos ingredientes aburridos en tu cocina? ¿Quieres darle un giro inesperado a tus comidas? Bueno, ¡tenemos la solución para ti! ¿Por qué no aprovechar al máximo esos traviesos ratones que merodean tu cocina? ¡Sí, has leído bien! Estos pequeños amigos peludos pueden convertirse en la sorpresa secreta de tus recetas.",
        "Sopa de Ratón al Estilo Gourmet",
        "Nada dice 'alta cocina' como una sopa de ratón. Para comenzar, asegúrate de atrapar a tu ratón con elegancia y destreza culinaria. Luego, lávelo a conciencia (porque la higiene es importante, incluso en esta broma) y colócalo en una olla con agua hirviendo. Añade algunas hierbas y especias, y ¡voilà! Tendrás una sopa de ratón que impresionará a tus invitados. Solo asegúrate de servirla en porciones muy pequeñas.",
        "Ratón a la Parrilla con Salsa Especial",
        "¿Quieres impresionar a tus amigos en la próxima parrillada? No busques más allá de tu despensa, donde seguramente encontrarás un ratón dispuesto a ser la estrella de la parrilla. Sazona al ratón con tus especias favoritas, ásalo a la parrilla hasta que esté dorado y crujiente, y sírvelo con una salsa especial de tu elección. ¡Una experiencia culinaria inolvidable!",
        "Ratón a la Vinagreta de Frambuesa",
        "Para un toque más sofisticado, prueba el ratón a la vinagreta de frambuesa. Marida perfectamente con una ensalada de hojas verdes frescas y nueces. Los ratones pequeños funcionan mejor para esta receta, ya que son más tiernos y jugosos. Añade una vinagreta de frambuesa casera para darle un toque de elegancia.",
        "Postre Sorpresa de Ratón",
        "¿Quieres sorprender a tus invitados con un postre inolvidable? Prueba nuestra receta de pastel sorpresa de ratón. Hornea un pastel de tu elección y, una vez enfriado, coloca un ratón cuidadosamente lavado en el centro. Cubre con crema batida y frutas frescas para una presentación espectacular. ¡La sorpresa en sus caras será impagable!"
      ],
      "img": "https://img.freepik.com/fotos-premium/numerosas-ratas-escena-interior-cocina-muchos-roedores-cocina-ia-generativa_174954-1488.jpg",
      "user_id": 1,
      "createdAt": "2023-08-17T15:34:00Z",
      "updatedAt": "2023-09-10T16:41:44.849Z"
    },
    {
      "id": 3,
      "title": "Los Sorprendentes Beneficios de Comer Helado Frito",
      "article": [
        "¡Atención, amantes de los placeres culinarios! Hoy les traemos una revelación que sacudirá sus papilas gustativas y hará que reconsideren sus elecciones dietéticas. ¿Alguna vez te has preguntado por qué los helados fritos aún no han sido declarados como un súper alimento? Bueno, prepárate para descubrir los supuestos beneficios de esta deliciosa delicia frita. ¡Asegúrate de no tomar esto en serio!",
        "Aumento de la Resistencia al Frío:",
        "¿Te mueres de frío en invierno? ¡No hay problema! Comer helado frito puede aumentar tu resistencia al frío. El aceite caliente en el que se fríe el helado actúa como una capa aislante, manteniéndote caliente incluso en las condiciones más gélidas. ¡Despídete de los abrigos!",
        "Habilidad Ninja Mejorada:",
        "¿Alguna vez has soñado con ser un ninja? Comer helado frito te acerca un paso más a ese sueño. Los helados fritos son resbaladizos y difíciles de agarrar, lo que te obliga a desarrollar reflejos ninja para evitar que se te caigan al suelo. ¡Prepárate para esquivar y atrapar como un auténtico maestro ninja!",
        "Satisfacción Instantánea:",
        "¿Te abruma el estrés diario? El helado frito es tu respuesta. El acto de sumergir una bola de helado en aceite caliente y verla convertirse en una deliciosa bola crujiente es tan satisfactorio que todos tus problemas parecerán desvanecerse. No es necesario un spa, ¡solo un plato de helado frito!",
        "Lecciones de Paciencia:",
        "Necesitas trabajar en tu paciencia? El helado frito es tu entrenador personal. Tienes que esperar a que el aceite esté a la temperatura perfecta y a que el helado esté bien congelado antes de freírlo. ¡Practicarás la paciencia con cada bocado!"
      ],
      "img": "https://irepo.primecp.com/2016/09/300292/Crunchy-Almond-Ice-Cream-Balls_Category-CategoryPageDefault_ID-1880574.jpg?v=1880574",
      "user_id": 1,
      "createdAt": "2023-08-17T15:34:00Z",
      "updatedAt": "2023-09-10T17:08:31.924Z"
    },
    {
      "id": 4,
      "title": "¡Las Cucarachas Limpia-Cocinas: La Revolución Nocturna en la Limpieza!",
      "article": [
        "¿Te has preguntado alguna vez cómo es que tu cocina está impecable por la mañana, a pesar de que dejaste platos sucios y migajas por todas partes antes de acostarte? La respuesta es simple: ¡tienes un ejército de cucarachas limpiacocinas trabajando en tu beneficio!",
        "Las Cucarachas Maestras de la Limpieza",
        "A pesar de su reputación como plagas no deseadas, estas cucarachas han decidido tomar un giro inesperado en su vida y convertirse en expertas de la limpieza nocturna. Mientras tú duermes plácidamente, estas valientes cucarachas se dedican a hacer que tu cocina brille como nunca antes.",
        "Su Rutina de Limpieza Nocturna",
        "Inspección Inicial: Comienzan su jornada revisando detenidamente todos los rincones de la cocina en busca de migajas y manchas. Nada escapa a su aguda vista.",
        "Equipo de Limpieza: Usan sus antenas para detectar las áreas más sucias y luego se comunican de manera efectiva para asignar tareas. Algunas se enfocan en lavar platos, mientras que otras barren y trapean el suelo.",
        " Limpieza a Fondo: No escatiman esfuerzos. Lavan cada plato, utensilio y superficie, dejando todo impecable. ¡Incluso se encargan de las esquinas más difíciles!",
        "Secado Rápido: Usan su velocidad para secar los platos recién lavados antes de dejarlos en su lugar. No quieren que te despiertes y encuentres una pila de platos mojados.",
        "Tareas de Mantenimiento: Además de la limpieza, también hacen pequeñas reparaciones en la cocina. Si una puerta de gabinete está suelta, la ajustan; si una llave gotea, la reparan. Son multitarea y muy habilidosas.",
        "Su Motivación",
        "¿Por qué estas cucarachas decidieron tomar la senda de la limpieza en lugar de causar problemas? Algunos dicen que fue un llamado a la aventura, otros que buscan redimir su mala reputación. Pero una cosa es segura: estas cucarachas limpiacocinas son las heroínas no reconocidas de la cocina moderna.",
        "Cómo Agradecerles",
        "Si alguna vez te preguntas cómo mostrar tu gratitud a tus cucarachas limpiacocinas, simplemente puedes dejar algunas migajas adicionales de comida de vez en cuando. ¡Después de todo, todos merecemos un bocadillo por un trabajo bien hecho!"
      ],
      "img": "https://gestinsa-sa.com/wp-content/uploads/2018/02/cucaracha-rubia-en-cocinas.jpg",
      "user_id": 1,
      "createdAt": "2023-09-14T19:32:49.567Z",
      "updatedAt": "2023-09-14T19:32:49.567Z"
    }
  ]
}